Revit 2027 API
GlobalParameter.GetLabelName Method
 Returns the name of this parameter's label, which is used to label dimension elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetLabelName()
Public Function GetLabelName As String
public:
String^ GetLabelName()
member GetLabelName : unit -> string
Return Value
String
 The name of the parameter's label.
Remarks
 Note that a Label equals a parameter's name if the parameters is non-reporting. Reporting parameters, however, have their labels suffixed by a special string to make it obvious the parameters is reporting (thus suitable to be driven by a dimension.)
See Also
Reference
GlobalParameter Class
Autodesk.Revit.DB Namespace